In [127]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split

In [128]:
data = pd.read_csv('titanic.csv')

In [129]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [130]:
data.Survived.value_counts() #It is almost balanced

0    549
1    342
Name: Survived, dtype: int64

In [131]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 1,inplace = True)

In [132]:
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [133]:
encoder = LabelEncoder()

In [134]:
data['sex'] = encoder.fit_transform(data['Sex'])
data.drop(columns = ['Sex'],inplace = True)

In [135]:
data.head()

   Survived  Pclass   Age     Fare  sex
0         0       3  22.0   7.2500    1
1         1       1  38.0  71.2833    0
2         1       3  26.0   7.9250    0
3         1       1  35.0  53.1000    0
4         0       3  35.0   8.0500    1

In [149]:
data.Age = data.Age.fillna(data.Age.mean())

In [150]:
X = data.drop(columns = ['Survived'])
Y = data['Survived']

In [164]:
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size = 0.2,random_state = 2)

In [165]:
from sklearn.tree import DecisionTreeClassifier

In [172]:
model = DecisionTreeClassifier()

In [173]:
model.fit(X_train,Y_train)

DecisionTreeClassifier()

In [175]:
model.score(X_test,Y_test)

0.7653631284916201